v2006/overPimpleDyMFoam_single/background/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
     overset
    {
        type            overset;
	value		$internalField;
    }
wall
{
        type            movingWallVelocity;
        value           uniform (0 0 0);
}


maxX
{
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
}

minX
{
        type            zeroGradient;
}

maxY
{
        type            zeroGradient;
}

minY
{
        type            zeroGradient;
}

maxZ
{
        type            zeroGradient;
}

minZ
{
        type            zeroGradient;
}


}

// ************************************************************************* //
