v2006/overPimpleDyMFoam_single/background/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     overset
    {
        type            overset;
	value		$internalField;
    }
wall
{
        type            zeroGradient;
}


maxX
{
        type            fixedValue;
        value           $internalField;
}

minX
{
        type            zeroGradient;
}

maxY
{
        type            zeroGradient;
}

minY
{
        type            zeroGradient;
}

maxZ
{
        type            zeroGradient;
}

minZ
{
        type            zeroGradient;
}
}
// ************************************************************************* //
